y1s1/cy1601-math-1/module-1a/notes.tex
% Created 2023-08-26 Sat 18:02
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{tikz, array, pgfplots, xcolor}
\author{Hankertrix}
\date{\today}
\title{Math Module 1A Lecture Notes}
\hypersetup{
 pdfauthor={Hankertrix},
 pdftitle={Math Module 1A Lecture Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.6.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents

\newpage


\section{Sets}
\label{sec:org2925294}
A set is basically just a collection of objects, and the objects inside a set are called elements, or points. To say that \(x\) is an element of set \(A\) is represented by \(x \in A\) or \(A \ni x\). Similarly, to say that \(x\) is not an element of set \(A\) is represented by \(x \notin A\). A set is usually described using curly braces \(\{\}\).
\\[0pt]

Examples:

\[A = \{1,2,3\} \rightarrow 1 \in A, 2 \in A, 3 \in A, 4 \notin A, \pi \notin A\]
\[B = \{\text{Homer}, \text{Marge}, \text{Bart}, \text{Lisa}, \text{Maggie}\}\]
\[\text{Homer}\in B, 1 \notin B, \text{Ned Flanders} \notin B\]


\subsection{Describing sets}
\label{sec:orgcb4e38c}

Common ways to describe sets include:

\[A = \{x: \text{some condition}\}\]
\[\text{A is the set of objects x for which the condition is true.}\]
\[B = \{x \notin B: \text{some condition}\}\]
\[\text{B is the set of objects x in Set B for which the condition is true}\]
\\[0pt]
Examples:

\[\mathbb{Z} = \{x: \text{x is an integer}\} = \{0, 1, -1, 2, -2, ...\}\]
\[A = \{x \in \mathbb{Z}: x = 2k \text{ for some } k \in \mathbb{Z}\} = \{0, 2, -2, 4, -4, ...\}\]

\subsection{Subsets and equal sets}
\label{sec:orgf693be2}
Definition: If each element of the set \(A\) also belongs to the set \(B\), then \(A\) is a subset of \(B\), which is represented by \(A \subset B\).

If \(A\) is a subset of \(B\) and \(B\) is also a subset of \(A\), then the sets \(A\) and \(B\) are considered to be \textbf{equal}, which is represented by \(A = B\).

\subsection{Standard sets}
\label{sec:org24b2eb4}

\[\mathbb{N} = \{1, 2, 3, 4, ...\} \text{ is the set of natural numbers}\]
\[\mathbb{Z} = \{..., -2, -1, 0, -1, -2, ...\} \text{ is the set of integers}\]
\[\mathbb{Q} = \{\frac{m}{n} : m \in \mathbb{Z}, n \in \mathbb{N}\} \text{ is the set of rational numbers}\]
\[\mathbb{R} \text{ is the set of real numbers}\]

Examples:
\[-\frac{3}{4} \in \mathbb{Q}, \sqrt{2} \notin \mathbb{Q}, \pi \notin \mathbb{Q}, e \notin \mathbb{Q}\]
\[\mathbb{N} \subset \mathbb{Z} \subset \mathbb{Q} \subset \mathbb{R}\]

\subsection{Empty set}
\label{sec:org70fea7c}
A set that has no elements is called an empty set and is denoted by \(\{\}\) or \(\emptyset\). The empty set does not contain anything, not even the number 0, as a set containing the number 0 actually contains 1 element and is hence not empty.

\subsection{Unions}
\label{sec:org779d557}
The union \(A \cup B\) of the sets \(A\) and \(B\) is the set:
\[A \cup B = \{ x : x \in A \text{ or } x \in B \text{ or x in both } A \text{ and } B\}\]

Example:
\[A = \{1, 2, 3\}, B = \{-1, 1\}\]
\[A \cup B = \{-1, 1, 2, 3\}\]

\subsection{Intersections}
\label{sec:org34e4aa9}
The intersection \(A \cap B\) of the sets \(A\) and \(B\) is the set:
\[A \cap B = \{ x : x \in A \text{ and } x \in B\}\]

Example:
\[A = \{1, 2, 3\}, B = \{-1, 1\}\]
\[A \cap B = \{1\}\]

\subsection{Subtracting sets}
\label{sec:org8776bc9}
The set "A minus B", written as \(A \setminus B\), is the following set:
\[A \setminus B = \{ x : x \in A \text{ and } x \notin B\}\]

Example:
\[A = \{1, 2, 3\}, B = \{-1, 1\}\]
\[A \setminus B = \{2, 3\}\]

\subsection{The real number line}
\label{sec:orgf79aabe}
We can represent the set of real numbers geometrically using a number line:
\\[0pt]

\begin{center}
\begin{tikzpicture}
\draw[latex-latex] (-3.5,0) -- (3.5,0) ; %edit here for the axis
\foreach \x in  {-3,-2,-1,0,1,2,3} % edit here for the vertical lines
\draw[shift={(\x,0)},color=black] (0pt,3pt) -- (0pt,-3pt);
\foreach \x in {-3,-2,-1,0,1,2,3} % edit here for the numbers
\draw[shift={(\x,0)},color=black] (0pt,0pt) -- (0pt,-3pt) node[below]
{$\x$};
\end{tikzpicture}
\end{center}

\subsection{Irrational numbers}
\label{sec:org3b3a6ce}
There is no rational number x with the property that \(x^2 = 2\). \(x\) cannot be properly described by any rational number. However, the real number \(\sqrt{2}\) has this property. There are many real numbers that are not rational. Such numbers are called irrational numbers and some important examples are the constants \(\pi\) and \(e\).

\[x \text{ is irrational means that } x \in \mathbb{R} \setminus \mathbb{Q}\]

\newpage

\subsection{Intervals}
\label{sec:orgcad034f}
Intervals are special subsets of real number.
\\[0pt]

For \(a, b \in \mathbb{R}, a < b\), we use the notation:

\[\text{1. } (a, b] = \{x \in \mathbb{R}, a < x \le b\}\]

\begin{center}
\begin{tikzpicture}

% The number line
\draw[latex-latex] (-2.5,0) -- (2.5,0);

% The thick line
\draw[very thick, color=red] (-2,0) -- (2,0);

% The circles
\path [draw=red, fill=white, thick] (-2,0) circle (2pt);
\path [draw=red, fill=red] (2,0.0) circle (2pt);

% The labels
\node[below, color=red] at (-2,-0.2) {$a$};
\node[below, color=red] at (2,-0.1){$b$};

\end{tikzpicture}
\end{center}




\[\text{2. } [a, b) = \{x \in \mathbb{R}, a \le x < b\}\]

\begin{center}
\begin{tikzpicture}

% The number line
\draw[latex-latex] (-2.5,0) -- (2.5,0);

% The thick line
\draw[very thick, color=red] (-2,0) -- (2,0);

% The circles
\path [draw=red, fill=red] (-2,0) circle (2pt);
\path [draw=red, fill=white, thick] (2,0.0) circle (2pt);

% The labels
\node[below, color=red] at (-2,-0.2) {$a$};
\node[below, color=red] at (2,-0.1){$b$};

\end{tikzpicture}
\end{center}




\[\text{3. } [a, b] = \{x \in \mathbb{R}, a \le x \le b\}\]

\begin{center}
\begin{tikzpicture}

% The number line
\draw[latex-latex] (-2.5,0) -- (2.5,0);

% The thick line
\draw[very thick, color=red] (-2,0) -- (2,0);

% The circles
\path [draw=red, fill=red] (-2,0) circle (2pt);
\path [draw=red, fill=red] (2,0.0) circle (2pt);

% The labels
\node[below, color=red] at (-2,-0.2) {$a$};
\node[below, color=red] at (2,-0.1){$b$};

\end{tikzpicture}
\end{center}




\[\text{4. } (a, b) = \{x \in \mathbb{R}, a < x < b\}\]

\begin{center}
\begin{tikzpicture}

% The number line
\draw[latex-latex] (-2.5,0) -- (2.5,0);

% The thick line
\draw[very thick, color=red] (-2,0) -- (2,0);

% The circles
\path [draw=red, fill=white, thick] (-2,0) circle (2pt);
\path [draw=red, fill=white, thick] (2,0.0) circle (2pt);

% The labels
\node[below, color=red] at (-2,-0.2) {$a$};
\node[below, color=red] at (2,-0.1){$b$};

\end{tikzpicture}
\end{center}




\begin{center}
\begin{align*}
\text{5. } &[a, \infty) = \{x \in \mathbb{R}, a \le x\} \\
&(a, \infty) = \{x \in \mathbb{R}, a < x\} \\
&(-\infty, b] = \{x \in \mathbb{R}, x \le b\} \\
&(-\infty, b) = \{x \in \mathbb{R}, x < b\} \\
&(-\infty, \infty) = \mathbb{R}
\end{align*}
\end{center}

\newpage


\section{Logic}
\label{sec:orgeada2ea}


\subsection{Statements}
\label{sec:orgcb916c3}
In Maths, a statement is either true or false. A statement in maths cannot be both true and false, or be neither true nor false.
\\[0pt]

Examples:

\[4 < 7 \rightarrow \text{True}\]
\[4 = 7 \rightarrow \text{False}\]
\[\text{There are infinitely many prime numbers.} \rightarrow \text{True}\]
\[\text{All prime numbers are odd.} \rightarrow \text{False}\]
\[\text{The real part of every non-trivial zero of the Riemann zeta function is 1/2.} \rightarrow \text{?}\]

\subsection{Examples of non-statements}
\label{sec:orgf608324}

\[4.\]
\[\text{Hello!}\]
\[\text{This sentence is false.}\]
