y1s1/cy1601-math-1/module-1a/notes.tex

\subsection{Negating a statement}
\label{sec:org247ac1b}
The negation \(not\) \(P\) of a statement \(P\), is a statement that is false when \(P\) is true and is true when \(P\) is false.
\\[0pt]

Truth table:

\begin{center}
\begin{tabular}{ |c|c| }
\hline
P & not P \\
\hline
T & F \\
\hline
\end{tabular}
\end{center}




More examples:

\begin{flushleft}
\begin{tabular}{ | m{15em} | m{15em} | }
\hline
P & not P \\
\hline
x = 7 & x $\neq$ 7 \\
\hline
x < 7 & x $\ge$ 7 \\
\hline
All NTU students are younger than 30. & There exists an NTU student that is at least 30. \\
\hline
There exists a professor in NTU that is sane. & All professors in NTU are insane. \\
\hline
\end{tabular}
\end{flushleft}

\subsection{"For all" statements}
\label{sec:orgfbca6e2}
"For all" is represented by "\(\forall\)".

\subsection{"There exists" statements}
\label{sec:org431e11d}
"There exists" is represented by "\(\exists\)".

\subsection{Interactions between "for all" and "there exists" statements}
\label{sec:org640407b}
In general, the negation of "\(\forall x \in A, P(x) \text{ is true}\)", is "\(\exists x \in A, P(x) \text{ is false}\)". Similarly, the negation of "\(\exists x \in A, P(x) \text{ is true}\)", is "\(\forall x \in A, P(x) \text{ is false}\)".


\section{Open sets}
\label{sec:orga7c46eb}
A set \(A \subset \mathbb{R}\) is open if for every \(x \in A\), there exists a \(\delta > 0\) such that \((x - \delta, x + \delta) \subset A\). The set \(A\) is not open when there exists \(x \in A\) such that for every \(\delta > 0\), \((x - \delta, x + \delta) \notin A\).
\\[0pt]

To make this definition easier to understand, let's assume \(\delta\) to be a very small number. Let's look at the set of \((3,5)\). If we pick a \(x\) value that is very close to the boundary, like 4.9999 (\(x \neq 5\) as the set doesn't include 5), there's still a value of \(\delta\) that is greater than 0 (\(\delta > 0\)) that can be added to 4.9999 that will not cause \((x + \delta)\) to exceed the bounding value. In this case, \(\delta\) would be 0.000001. Similarly, for the lower bound, we can pick a \(x\) value that is very close to the boundary, such as 3.0001 (\(x \neq 3\) as the set doesn't include 3), and there will still be a non-zero \(\delta\) that is greater than 0 (\(\delta > 0\)) that can be subtracted from \(x\) that will not cause \((x - \delta)\) to be lower than the lower bound. In this case, \(\delta\) would be 0.00001. Hence, \((3,5)\) would be an open set.
\\[0pt]

Now, let's look at the set of \([3,5]\). If we pick a \(x\) value that is at the boundary (remember that the set includes the boundaries), like 5, there's no value of \(\delta\) that is greater than 0 (\(\delta > 0\)) that can be added to 5 that will not cause \((x + \delta)\) to exceed the bounding value. Similarly, for the lower bound, if we pick a \(x\) value that is at the boundary (the set includes the boundaries), such as 3, and there's no value of \(\delta\) that is greater than 0 (\(\delta > 0\)) that can be subtracted from \(x\) that will not cause \((x - \delta)\) to be lower than the lower bound. Hence, \((3,5)\) would not be an open set.
\\[0pt]

Examples (suppose \(a < b\)):

\[\text{1. } (a, b) \rightarrow \text{ Open}\]

\begin{center}
\begin{tikzpicture}

% The number line
\draw[latex-latex] (-1.5,0) -- (1.5,0);

% The thick line
\draw[very thick, color=red] (-1,0) -- (1,0);

% The circles
\path [draw=red, fill=white, thick] (-1,0) circle (2pt);
\path [draw=red, fill=white, thick] (1,0.0) circle (2pt);

% The labels
\node[below, color=red] at (-1,-0.2) {$a$};
\node[below, color=red] at (1,-0.1){$b$};

\end{tikzpicture}
\end{center}




\[\text{2. } (a, b] \rightarrow \text{ Not open}\]

\begin{center}
\begin{tikzpicture}

% The number line
\draw[latex-latex] (-1.5,0) -- (1.5,0);

% The thick line
\draw[very thick, color=red] (-1,0) -- (1,0);

% The circles
\path [draw=red, fill=white, thick] (-1,0) circle (2pt);
\path [draw=red, fill=red] (1,0.0) circle (2pt);

% The labels
\node[below, color=red] at (-1,-0.2) {$a$};
\node[below, color=red] at (1,-0.1){$b$};

\end{tikzpicture}
\end{center}




\[\text{3. } [a, b] \rightarrow \text{ Not open}\]

\begin{center}
\begin{tikzpicture}

% The number line
\draw[latex-latex] (-1.5,0) -- (1.5,0);

% The thick line
\draw[very thick, color=red] (-1,0) -- (1,0);

% The circles
\path [draw=red, fill=red] (-1,0) circle (2pt);
\path [draw=red, fill=red] (1,0.0) circle (2pt);

% The labels
\node[below, color=red] at (-1,-0.2) {$a$};
\node[below, color=red] at (1,-0.1){$b$};

\end{tikzpicture}
\end{center}




\[\text{4. } (a, \infty) \rightarrow \text{ Open}\]

\begin{center}
\begin{tikzpicture}

% The number line
\draw[latex-latex] (-1.5,0) -- (1.5,0);

% The thick line
\draw[very thick, color=red] (-1,0) -- (1.4,0);

% The circles
\path [draw=red, fill=red] (-1,0) circle (2pt);

% The labels
\node[below, color=red] at (-1,-0.2) {$a$};

\end{tikzpicture}
\end{center}




\[\text{5. } [a, \infty) \rightarrow \text{ Not open}\]

\begin{center}
\begin{tikzpicture}

% The number line
\draw[latex-latex] (-1.5,0) -- (1.5,0);

% The thick line
\draw[very thick, color=red] (-1,0) -- (1.4,0);

% The circles
\path [draw=red, fill=white, thick] (-1,0) circle (2pt);

% The labels
\node[below, color=red] at (-1,-0.2) {$a$};

\end{tikzpicture}
\end{center}


\subsection{Not open sets}
\label{sec:orga4c66bc}
A set is \textbf{not open} means that \textbf{there exists \(x \in A\) such that for every \(\delta > 0\), \((x - \delta, x + \delta) \not\subset A\)}.




\section{Closed sets}
\label{sec:org940d7e0}
A set \(A \subset \mathbb{R}\) is closed if its "complement" \(\mathbb{R} \setminus A\) is open.

\newpage

Examples (suppose \(a < b\)):

\[\text{1. } (a, b) \rightarrow \text{ Not closed}\]
\[\mathbb{R} \setminus (a, b) = (-\infty, a] \cup [b, \infty) \text{ is not open. Hence } (a, b) \text{ is not closed.}\]

\[\text{2. } (a, b] \rightarrow \text{ Not closed}\]
\[\mathbb{R} \setminus (a, b] = (-\infty, a] \cup [b, \infty) \text{ is not open. Hence } (a, b] \text{ is not closed.}\]

\[\text{3. } [a, b] \rightarrow \text{Closed}\]
\[\mathbb{R} \setminus [a, b] = (-\infty, a) \cup (b, \infty) \text{ is open. Hence } [a, b] \text{ is closed.}\]

\[\text{4. } (a, \infty) \rightarrow \text{ Not closed}\]
\[\mathbb{R} \setminus (a, \infty) = (-\infty, a] \text{ is not open. Hence } (a, \infty) \text{ is not closed.}\]

\[\text{5. } [a, \infty) \rightarrow \text{ Closed}\]
\[\mathbb{R} \setminus [a, \infty) = (-\infty, a) \text{ is open. Hence } (a, \infty) \text{ is closed.}\]

\[\text{6. } \mathbb{R} \rightarrow \text{ Closed}\]
\[\mathbb{R} \setminus \mathbb{R} = \emptyset \text{ is open. Hence } \mathbb{R} \text{ is closed.}\]

\[\text{7. } \emptyset \rightarrow \text{ Closed}\]
\[\mathbb{R} \setminus \emptyset = \mathbb{R} \text{ is open. Hence } \emptyset \text{ is closed.}\]
\\[0pt]

From the examples, we can see that the set \((a, b]\) is neither open nor closed and the sets \(\mathbb{R}\) and \(\emptyset\) are both closed and open at the same time. \(\mathbb{R}\) and \(\emptyset\) are known as clopen sets, which are sets that are both closed and open. This means that open and closed sets are \textbf{not mutually exclusive} and both can happen at the same time.
\\[0pt]

In general, an open set is usually a set that does not include its bounding values while a closed set is a set that includes its bounding values, but this is not always the case, as seen from the sets \((a, b]\), \(\mathbb{R}\) and \(\emptyset\).


\section{Logical AND}
\label{sec:orgb84b2ac}
Given two statements \(P\) and \(Q\), the statement \(P\) \textbf{AND} \(Q\) is true when both \(P\) and \(Q\) are true, and false otherwise.
\\[0pt]

Truth table:

\begin{center}
\begin{tabular}{ |c|c|c| }
\hline
P & Q & P AND Q \\
\hline
T & T & T \\
\hline
T & F & F \\
\hline
F & T & F \\
\hline
F & F & F \\
\hline
\end{tabular}
\end{center}
