y1s1/cy1601-math-1/module-1a/notes.org
* Logical OR
The statement $P$ *OR* $Q$ is false when *both* $P$ and $Q$ are false, and true otherwise.
\\

Truth table:

\begin{center}
\begin{tabular}{ |c|c|c| }
\hline
P & Q & P OR Q \\
\hline
T & T & T \\
\hline
T & F & T \\
\hline
F & T & T \\
\hline
F & F & F \\
\hline
\end{tabular}
\end{center}

Examples:

\begin{center}
\begin{tabular}{ |c|c|c|c|c| }
\hline
P & Q & $not$ Q & (P AND $not$ Q) & $not$ (P AND $not$ Q) \\
\hline
T & T & F & F & T \\
\hline
T & F & T & T & F \\
\hline
F & T & F & F & T \\
\hline
F & F & T & F & T \\
\hline
\end{tabular}
\end{center}

\newpage


* Implications
Many statements in maths have the form "if something, then something". For example:
- If $x$ is an even integer, then $x^2$ is an even integer.
- If $f(x)$ is differentiable at $x = a$, then $f(x)$ is continuous at $x = a$.

We often use implications in our day-to-day life.
- If it rains, then I'll bring an umbrella.

** Notation
The statement "if $A$, then $B$" can also be expressed as $A \Rightarrow B$, which means $A$ implies $B$.

*** Example 1

\[x \text{ is an even integer. } \Rightarrow x^2 \text{ is an even integer.}\]

*** Example 2

If $x > 0$ then $x^2 > x^\frac{1}{2}$. The statement is false, as when $x = 1$, $x > 0$ but $x^2 = x^\frac{1}{2}$. The implication mentioned above is false because it is possible for "$x > 0$" to be true without "$x^2 > x^\frac{1}{2}$" to be true. The first statement does not guarantee the second and hence the implication is false. This is usually demonstrated using a counterexample.

The truth value of the above implication does not "depend on $x$". It is irrelevant that $x^2 > x^\frac{1}{2}$ for some $x > 0$. The above implication is simply *false*.

\newpage

*** Example 3

If $p_k$ is the $k \text{th}$ prime number, i.e.

\[p_1 = 2, p_2 = 3, p_3 = 5, p_4 = 7, p_5 = 11\]

And if $n$ is a positive integer, then

\[1 + \prod_{k=1}^{n} p_k = 1 + p_1 \cdot ... \cdot p_n\]

Is also a prime number.


\begin{center}
\begin{tabular}{ c|c }
n & \(1 + \prod_{k=1}^{n} p_k\) \\
\hline
1 & \(1 + 2 = 3 \rightarrow \text{ prime}\) \\
2 & \(1 + 2 \cdot 3 = 7 \rightarrow \text{ prime}\) \\
3 & \(1 + 2 \cdot 3 \cdot 5 = 31 \rightarrow \text{ prime}\) \\
4 & \(1 + 2 \cdot 3 \cdot 5 \cdot 7 = 211 \rightarrow \text{ prime}\) \\
5 & \(1 + 2 \cdot 3 \cdot 5 \cdot 7 \cdot 11 = 2311 \rightarrow \text{ prime}\) \\
6 & \(1 + 2 \cdot 3 \cdot 5 \cdot 7 \cdot 11 \cdot 13 = 59,509 \rightarrow \textbf{ not prime}\)\\
\end{tabular}
\end{center}

Hence, the implication is *false*.

\newpage

*** Example 4

If $a$ and $b$ are positive real numbers, then:
\[\frac{a + b}{2} \ge \sqrt{ab}\]

\[\frac{a + b}{2} \text{ is the arithmetic mean of a and b.}\]
\[\sqrt{ab} \text{ is the geometric mean of a and b.}\]
\\

The implication is *true*, as for $a, b > 0$, we have
\begin{align*}
\frac{a + b}{2} - \sqrt{ab} &= \frac{a}{2} - \sqrt{ab} + \frac{b}{2} \\
&= (\sqrt{\frac{a}{2}} - \sqrt{\frac{b}{2}})^2 \\
&\ge 0
\end{align*}

*** Example 5

If $x$ is a real number and $x^2 < 0$, then $x$ is a pink elephant. This statement is *true*.
\\

If we let:

\[A = \{x \in \mathbb{R} : x^2 < 0\} = \emptyset\]

The last statement can be phrased as "for all $x \in A, x$ is a pink elephant". The negation of this statement would be "there exists $x \in A$, such that $x$ is not a pink elephant". Since the negation of the original statement is *false*, the original statement must be *true*.

\newpage

** Another way to think about implications
The implication $P \Rightarrow Q$ is another way of saying $not (\text{P AND } not \text{ Q})$.

\begin{center}
\begin{tabular}{ |c|c|c| }
\hline
P & Q & $not$ (P AND $not$ Q) \\
\hline
T & T & T \\
\hline
T & F & F \\
\hline
F & T & T \\
\hline
F & F & T \\
\hline
\end{tabular}
\end{center}

\[\downarrow\]

\begin{center}
\begin{tabular}{ |c|c|c| }
\hline
P & Q & $P \Rightarrow Q$ \\
\hline
T & T & T \\
\hline
T & F & F \\
\hline
F & T & T \\
\hline
F & F & T \\
\hline
\end{tabular}
\end{center}


* Equivalences
An implication has a "direction". For example, the implication \(x = 2 \Rightarrow x^2 = 4\) is *true* but if we turn it around, \(x^2 = 4 \Rightarrow x = 2\), we get something *false*.
\\

If we instead consider the implication \(x = 2 \text{ or } x = -2 \Rightarrow x^2 = 4\), which is still true, we see that the "reverse" implication \(x^2 = 4 \Rightarrow x = 2 \text{ or } x = -2\) also holds. Hence, the two statements "\(x = 2 \text{ or } x = -2\)" and "\(x^2 = 4\)" are *equivalent*.
\\

The statement $(P \Rightarrow Q)$ and $(Q \Rightarrow P)$ can be written as $P \Leftrightarrow Q$. In this case, we say that $P$ and $Q$ are equivalent, or $P$ if and only if $Q$.

\newpage


* Contrapositive statement
Suppose that you *know* that the implication "if it rains, then your lecturer carries an umbrella" is a *true* statement. One day, you see your lecturer not carrying an umbrella, so you conclude that "if your lecturer does not carry an umbrella, then it does not rain".

The statements $P \Rightarrow Q$ and $not \text{ } Q \Rightarrow not \text{ } P$ are equivalent.

\begin{center}
\begin{tabular}{ |c|c|c|c|c|c| }
\hline
P & Q & $P \Rightarrow Q$ & $not$ Q & $not$ P & $not$ Q $\Rightarrow not$ P \\
\hline
T & T & T & F & F & T\\
\hline
T & F & F & T & F & F \\
\hline
F & T & T & F & T & T \\
\hline
F & F & T & T & T & T \\
\hline
\end{tabular}
\end{center}


* Functions

** Definition
Consider two sets $A$ and $B$. A *function* $f : A \rightarrow B$ is a rule that assigns to each element $x \in A$ exactly one element $f(x) \in B$ called the value of the function $f$ at the point $x$.
\\

Put simply, a function takes a set of inputs, $A$ and returns a set of outputs $B$. One input can only have one output.
\\

The set $A$ is called the *domain* of $f$, and $B$ is called the *codomain* of $f$. We also say that $f : A \rightarrow B$ is a function *from* A *to* B.
\\

*** Example 1

\[f : \mathbb{R} \rightarrow \mathbb{R}, f(x) = x^2\]
\[f(1) = 1, f(-2) = 4\]

\newpage

*** Example 2

Let \(A = \{\text{Homer}, \text{Marge}, \text{Bart}, \text{Lisa}, \text{Maggie}\}\) and define \(f : A \rightarrow \mathbb{N}\) by \(f(x) = \text{the age of } x \text{ in years.}\)

\[f(\text{Homer}) = 38\]
\[f(\text{Marge}) = 34\]
\[f(\text{Bart}) = 10\]
\[f(\text{Lisa}) = 8\]
\[f(\text{Maggie}) = 1\]

\[f(\text{Ned Flanders}) = \text{undefined}\]
\[\text{Ned Flanders} \notin A\]


*** Important note
For a function $f$ with domain $A, f(x)$ is only defined for $x \in A$.
\\

So for a function:
\[f : [0, \infty) \rightarrow \mathbb{R}\]
\[f(x) = x^2\]

\(f(-2) \neq 4\), instead \(f(-2) = \text{undefined}\) as $f(x)$ is only defined for $x \in A$.

\newpage

** Sequences

*** Definition
A function $f : A \rightarrow \mathbb{R}$ where $A$ is a subset of $\mathbb{N}$ is called a *sequence*.

**** Example 1

The function $f: \mathbb{N} \rightarrow \mathbb{R}$ defined by \(f(n) = 1 + \frac{(-1)^n}{n}\) is a sequence. We have:

\[f(1) = 1 + \frac{-1}{1} = 0, f(2) = 1 + \frac{1}{2} = \frac{3}{2}, f(3) = 1 + \frac{-1}{3} = \frac{2}{3}, \text{ etc.}\]

For sequences, we often use the notation $a_n$ instead of $f(n)$ and
\[(a_n), (a_n)_{n=1}^{\infty}, (a_1, a_2, a_3, ...), \text{ etc. instead of } f\]

