y1s1/cy1601-math-1/module-1a/notes.org
**** Example 2

The sequence in the example 1 would more commonly be described as
\[(a_n)_{n=1}^{\infty}, \text{ where } a_1 = 1 + \frac{-1}{1} = 0, a_2 = 1 + \frac{1}{2} = \frac{3}{2}, a_3 = 1 + \frac{-1}{3} = \frac{2}{3}, \text{ etc.}\]

\newpage

** Different ways of describing functions
A function can be described in any way. In fact, just using words is perfectly fine as long as the meaning is clear and unambiguous. Some particularly common ways are:
\\

*Explicit formulae* like:

\begin{align*}
f(x) &= sin(1+x^3), \\
g(y) &= \frac{1+y}{1-y}, \\
a_n &= 2^n.
\end{align*}

*Implicit formulae* like:

\[\sin g(t) = t, \qquad -\pi \le g(t) \le \frac{\pi}{2},\]

*Recurrent formulae* for a sequence, like:

\[a_1 = 2, a_{n+1} = 2a_n,\]
\[\text{so } a_1 = 2, a_2 = 2a_1 = 4, a_3 = 2a_3 = 8, \text{ etc.}\]
\[a_1 = 1, a_2 = 2, a_{n+1} = a_n + a_{n-1}\]
\[\text{so } a_1 = 1, a_2 = 2, a_3 = a_2 + a_1 = 3, a_4 = a_3 + a_2 = 5, \text{ etc.}\]


** The graph of a function
A function $f : A \rightarrow \mathbb{R}$ where $A \subset \mathbb{R}$ can be represented by its *graph*.

The graph of $f : A \rightarrow \mathbb{R}$ is formally defined as a set of pairs $(x, y)$.

\[G_f = \{(x, f(x)) : x \in A\}\]

\newpage

** The domain of a function
For a function $f : A \rightarrow B$, the set $A$ is called the *domain* of $f$. Note that the domain is part of the definition of a function, so:

\[f : \mathbb{R} \rightarrow \mathbb{R} \quad f(x) = x^2, \text{ and } g:[0, \infty] \rightarrow \mathbb{R} \quad g(x) = x^2\]

Are *different* functions.
\\

Below is the graph of \(\color{blue} f(x)\) versus \(\color{red} g(x)\):
\\

\begin{center}
\begin{tikzpicture}
\begin{axis}[xmin = -10.5, xmax = 10.5]
\addplot[domain = -10:10, color = blue]{x^2};
\addlegendentry{\(f(x)\)}
\end{axis}
\end{tikzpicture}
\[\]

\begin{tikzpicture}
\begin{axis}[xmin = -10.5,xmax = 10.5]
\addplot[domain= 0:10, color = red]{x^2};
\addlegendentry{\(g(x)\)}
\end{axis}
\end{tikzpicture}
\end{center}

*** The natural domain of a function
Usually, we will simply state an expression for $f$ without saying what the domain is. For example $f(x) = \sqrt{x-1}$, where the natural domain of $f$ is \(\{x : x - 1 \ge 0\} = [1, \infty)\).

If we don't say anything about the domain, we will assume that it is the largest set $A$, for which $f(x)$ 'makes sense' when $x \in A$. We also call this the *natural domain* of $f$.

** Image and range of a function

*** Definition
Consider a function \(f : A \rightarrow B\).
\\

For $K \subset A$, the set \(f(K) = \{f(x) : x \in K\} \subset B\), is called the *image* of the set K. The image of $f(A)$ of the whole domain $A$ is called the range of the function $f$.

*** Example 1
\[\text{Let } A = \{\text{Homer}, \text{Marge}, \text{Bart}, \text{Lisa}, \text{Maggie}\}\]
\[\text{and define } f : A \rightarrow \mathbb{N} \text{ by } f(x) = \text{ the age of } x\]
\[\text{Also, let } K = \{\text{Bart}, \text{Lisa}, \text{Maggie}\}.\]
\\

Remember that:

\[f(\text{Homer}) = 39\]
\[f(\text{Marge}) = 34\]
\[f(\text{Bart}) = 10\]
\[f(\text{Lisa}) = 8\]
\[f(\text{Maggie}) = 1\]
\\

Then the "range of $f$" \(= f(A) = \{f(x) : x \in A\} = \{38, 34, 10, 8, 1\}\)
\[f(K) = \{f(x): x \in K\} = \{10, 8, 1\}\]

*** Example 2

\[f(x) = \sqrt{1-x^2}\]
\\

Domain = \(\{x: 1 - x^2 \ge 0\} = \{ x : x^2 \le 1\} = [-1,1]\)
\\

Range = \(\{\sqrt{1 - x^2} : x \in [-1, 1] = [0, 1]\}\)

\newpage

* Properties of functions

** Increasing and decreasing functions

*** Definition
A function $f : A \rightarrow \mathbb{R}$ where $A \subset \mathbb{R}$, is said to be:

\[\text{\textbf{Increasing} if } x_1, x_2 \in A, x_1 < x_2 \Rightarrow f(x_1) \le f(x_2)\]
\[\text{\textbf{Decreasing} if } x_1, x_2 \in A, x_1 < x_2 \Rightarrow f(x_1) \ge f(x_2)\]
\[\textbf{Monotonic } \text{if it is either increasing or decreasing.}\]

Furthermore, if $B \subset A$, we say that $f$ is increasing/decreasing/monotonic *on B* if either of the above conditions hold of $x_1, x_2 \in B$.

** Strictly increasing and decreasing functions

*** Definition
A function \(f : A \rightarrow \mathbb{R} (A \subset \mathbb{R})\) is said to be:

\[\text{\textbf{Strictly increasing} if } x_1, x_2 \in A, x_1 < x_2 \Rightarrow f(x_1) < f(x_2)\]
\[\text{\textbf{Strictly decreasing} if } x_1, x_2 \in A, x_1 < x_2 \Rightarrow f(x_1) > f(x_2)\]
\[\textbf{Monotonic } \text{if it is either increasing or decreasing.}\]

Furthermore, if $B \subset A$, we say that $f$ is strictly increasing/decreasing/monotonic *on B* if either of the above conditions hold of $x_1, x_2 \in B$.

\newpage

*** Examples

\[f : \mathbb{R} \rightarrow \mathbb{R}, f(x) = x^2 \text{ is not increasing as:}\]
\[-1 < 0 \text{ but } f(-1) > f(0)\]
\\

\[f : [0, \infty] \rightarrow \mathbb{R}, f(x) = x^2 \text{ is strictly increasing as:}\]
\[x_1, x_2 \in (0, \infty) \text{ and } x_1 < x_2 \Rightarrow f(x_1) < f(x_2)\]
\\

\[f : \mathbb{R} \rightarrow \mathbb{R}, f(x) = 1 \text{ is increasing}\]
\[x_1, x_2 \in \mathbb{R} \text{ and } x_1 < x_2 \Rightarrow f(x_1) \le f(x_2)\]
\[\text{But not strictly increasing as:}\]
\[0, 1 \in \mathbb{R} \text{ and } 0 < 1 \text{ but } f(0) = f(1)\]


** Bounded functions

*** Definition
A function $f : A \rightarrow \mathbb{R}$ is *bounded* if there exists a $M > 0$ such that \(|f(x)| \le M, \text{ for all } x \in A\).
\\

In simpler terms, a function that is bounded is a function that doesn't approach $+\infty$ or $-\infty$.
\\

*Note that* \(|f(x)| \le M \Leftrightarrow - M \le f(x) \le M \).
\\

A function that is not bounded is said to be *unbounded*. Furthermore, if $B \subset A$, we say that $f$ is bounded *on B* if the above inequality holds for all $x \in B$.

*** Example 1
\[\sin x, \text{ } \cos x \text{ are bounded.}\]

The domain of $\sin x$ is $\mathbb{R}$. For all $x \in \mathbb{R}$, we have $|\sin x| \le 1$, so $\sin x$ is bounded. The same is true for $\cos x$.


*** Example 2
$x^2$ is bounded on the interval $[-2, 1]$, as for \(x \in [-2, 1]\) we have $|x^2| \le 4$, so $x^2$ is bounded on $[-2, 1]$.


** Locally bounded functions

*** Definition
A function $f : A \rightarrow \mathbb{R}$ is *locally bounded at point* $a \in A$ if there exists some $\delta > 0$ such that $f$ is bounded on $A \cap (a - \delta, a + \delta)$.
\\

A function that is *locally bounded* means that $f$ is locally bounded at every $a \in A$.

*** Example 1

Given the definition of $f$ below:

\[f : \mathbb{R} \setminus \{0\} \rightarrow \mathbb{R}, \text{ } f(x) = \frac{1}{x}\]

Show that $f$ is locally bounded.
\\

Let $A$ be the domain of $f$, i.e. \(A = \mathbb{R} \setminus \{0\}\), and suppose $a \in A$.
\\

Note that $a \neq 0$, so $a$ is within the domain of $f$.
\\

Let \(\delta = \frac{|a|}{2}, \text{ } M = \frac{2}{|a|}\), where $M, \delta > 0$ and
\[|x| > \frac{|a|}{2}, \text{ for } x \in (a - \delta, a + \delta) \cap A.\]

Therefore,
\begin{align*}
|f(x)| = \frac{1}{|x|} &< \frac{1}{\frac{|a|}{2}} \\
&< \frac{2}{|a|} \\
&< M, \text{ for } x \in (a - \delta, a + \delta) \cap A
\end{align*}

Hence, $f$ is bounded on \((a - \delta, a + \delta) \cap A\). Thus, $f$ is locally bounded.


