y1s1/cy1601-math-1/module-1a/notes.org
*** Example 2

Given the definition of $g$ below:

\begin{equation*}
g : \mathbb{R} \rightarrow \mathbb{R}, \text{ } g(x) = \begin{cases}
\frac{1}{x} & \text{ for } x \neq 0 \\
0 & \text{ for } x = 0
\end{cases}
\end{equation*}

Show that $g$ is not locally bounded.
\\

The definition of a locally bound function $f$ is that for each $a \in \mathbb{R}$, there exists $\delta > 0$ such that $f$ is bounded on \(a - \delta, a + \delta\).
\\

So for a function $f$ that is *not* locally bound, there exists some $a \in \mathbb{R}$, such that $f$ is not bounded on \(a - \delta, a + \delta\).
\\

The domain $A$ of $g$ is $\mathbb{R}$. Since $0 \in A$, and for all $\delta > 0, g$ is unbounded on \((0 - \delta, 0 + \delta) \cap A = (-\delta, \delta)\). That means $g$ is not locally bounded at 0 and thus $g$ is *not locally bounded*.


** Unbounded functions

*** Definition
From the definition of a bounded function, which is "a function $f : A \rightarrow \mathbb{R}$ is *bounded* if there exists a $M > 0$ such that \(|f(x)| \le M, \text{ for all } x \in A\)".
\\

A function that is not bounded is said to be *unbounded*, which is "$f$ is bounded if for all $M > 0$, there exists $x \in A$ such that $|f(x)| > M$".

\newpage

*** Example
Is the function $f(x) = \frac{1}{x}$ bounded or unbounded?
\\

For the graph below, \(\color{blue} y = f(x) = \frac{1}{x}\) is in blue, and \(\color{red} y = -M\) and \(\color{red} y = M\) are in red.
\\

\begin{tikzpicture}
\begin{axis}[axis lines = middle, xmin = -10, xmax = 10, ymin = -10, ymax = 10]

% The graph of y = 1/x
\addplot[domain = -10:-0.1, color = blue]{1/x};
\addplot[domain = 0.1:10, color = blue]{1/x};

% The graph of y = M
\addplot[domain = -10:10, color = red]{3.5};

% The graph of y = -M
\addplot[domain = -10:10, color = red]{-3.5};

\end{axis}
\end{tikzpicture}
\\

Domain of \(f = \mathbb{R} \setminus \{0\}\)
\\

Let $M > 0$, and take \(x = \frac{1}{2M}, x \in \mathbb{R} \setminus \{0\}\)

\[|f(x)| = \left|\frac{1}{\frac{1}{2M}} \right| = |2M| = 2M > 0\]

Hence, $f$ is unbounded.

\newpage

** Odd and even functions

*** Definition
A function $f : A \rightarrow \mathbb{R}$ is said to be:

\[\text{\textbf{Odd} if } x \in A \Rightarrow -x \in A \text{ and } f(-x) = -f(x).\]

The graph of $y = f(x)$ is symmetric about $(0, 0).
\\

\[\text{\textbf{Even} if } x \in A \Rightarrow -x \in A \text{ and } f(-x) = f(x).\]

The graph of $y = f(x)$ is symmetric about the y-axis.


** Periodic functions

*** Definition
A function $f : \mathbb{R} \rightarrow \mathbb{R}$ is said to be *periodic* if there exists some $T > 0$ such that \(f(x + T) = f(x), \text{ for all } x \in \mathbb{R}\).

The number $T$ is called a *period* for $f$.

** Examples
$\sin x$ and $\cos x$ are both periodic with period $2\pi$.
$\sin x$ is odd, $\cos x$ is even.
$x^2$ is even, $x^3$ is odd.
$e^x$ is neither odd nor even.
Given any function $f(x)$, the function $g(x) = f(|x|)$ is even.
