y1s1/cy1601-math-1/module-1a/notes.tex


\subsubsection{Example 2}
\label{sec:orgabd4f88}

Given the definition of \(g\) below:

\begin{equation*}
g : \mathbb{R} \rightarrow \mathbb{R}, \text{ } g(x) = \begin{cases}
\frac{1}{x} & \text{ for } x \neq 0 \\
0 & \text{ for } x = 0
\end{cases}
\end{equation*}

Show that \(g\) is not locally bounded.
\\[0pt]

The definition of a locally bound function \(f\) is that for each \(a \in \mathbb{R}\), there exists \(\delta > 0\) such that \(f\) is bounded on \(a - \delta, a + \delta\).
\\[0pt]

So for a function \(f\) that is \textbf{not} locally bound, there exists some \(a \in \mathbb{R}\), such that \(f\) is not bounded on \(a - \delta, a + \delta\).
\\[0pt]

The domain \(A\) of \(g\) is \(\mathbb{R}\). Since \(0 \in A\), and for all \(\delta > 0, g\) is unbounded on \((0 - \delta, 0 + \delta) \cap A = (-\delta, \delta)\). That means \(g\) is not locally bounded at 0 and thus \(g\) is \textbf{not locally bounded}.


\subsection{Unbounded functions}
\label{sec:orgd7ba15a}

\subsubsection{Definition}
\label{sec:org43df6d4}
From the definition of a bounded function, which is "a function \(f : A \rightarrow \mathbb{R}\) is \textbf{bounded} if there exists a \(M > 0\) such that \(|f(x)| \le M, \text{ for all } x \in A\)".
\\[0pt]

A function that is not bounded is said to be \textbf{unbounded}, which is "\(f\) is bounded if for all \(M > 0\), there exists \(x \in A\) such that \(|f(x)| > M\)".

\newpage

\subsubsection{Example}
\label{sec:orga0db1a7}
Is the function \(f(x) = \frac{1}{x}\) bounded or unbounded?
\\[0pt]

For the graph below, \(\color{blue} y = f(x) = \frac{1}{x}\) is in blue, and \(\color{red} y = -M\) and \(\color{red} y = M\) are in red.
\\[0pt]

\begin{tikzpicture}
\begin{axis}[axis lines = middle, xmin = -10, xmax = 10, ymin = -10, ymax = 10]

% The graph of y = 1/x
\addplot[domain = -10:-0.1, color = blue]{1/x};
\addplot[domain = 0.1:10, color = blue]{1/x};

% The graph of y = M
\addplot[domain = -10:10, color = red]{3.5};

% The graph of y = -M
\addplot[domain = -10:10, color = red]{-3.5};

\end{axis}
\end{tikzpicture}
\\[0pt]

Domain of \(f = \mathbb{R} \setminus \{0\}\)
\\[0pt]

Let \(M > 0\), and take \(x = \frac{1}{2M}, x \in \mathbb{R} \setminus \{0\}\)

\[|f(x)| = \left|\frac{1}{\frac{1}{2M}} \right| = |2M| = 2M > 0\]

Hence, \(f\) is unbounded.

\newpage

\subsection{Odd and even functions}
\label{sec:org0d8db97}

\subsubsection{Definition}
\label{sec:org9e724d4}
A function \(f : A \rightarrow \mathbb{R}\) is said to be:

\[\text{\textbf{Odd} if } x \in A \Rightarrow -x \in A \text{ and } f(-x) = -f(x).\]

The graph of \(y = f(x)\) is symmetric about \$(0, 0).
\\[0pt]

\[\text{\textbf{Even} if } x \in A \Rightarrow -x \in A \text{ and } f(-x) = f(x).\]

The graph of \(y = f(x)\) is symmetric about the y-axis.


\subsection{Periodic functions}
\label{sec:org213b5f0}

\subsubsection{Definition}
\label{sec:org3dc0143}
A function \(f : \mathbb{R} \rightarrow \mathbb{R}\) is said to be \textbf{periodic} if there exists some \(T > 0\) such that \(f(x + T) = f(x), \text{ for all } x \in \mathbb{R}\).

The number \(T\) is called a \textbf{period} for \(f\).

\subsection{Examples}
\label{sec:orgb2d699c}
\(\sin x\) and \(\cos x\) are both periodic with period \(2\pi\).
\(\sin x\) is odd, \(\cos x\) is even.
\(x^2\) is even, \(x^3\) is odd.
\(e^x\) is neither odd nor even.
Given any function \(f(x)\), the function \(g(x) = f(|x|)\) is even.
\end{document}